Revit 2027 API
ViewPrintingEventArgs.GetSettings Method
 Get the print settings of the active printing session.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IPrintSetting GetSettings()
Public Function GetSettings As IPrintSetting
public:
IPrintSetting^ GetSettings()
member GetSettings : unit -> IPrintSetting
Return Value
IPrintSetting
See Also
Reference
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace